proglang/scheme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>The Scheme Programming Language</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-02-21 13:03:34 IST"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">The Scheme Programming Language</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What is Scheme </a></li>
<li><a href="#sec-2">2 Why Scheme? </a></li>
<li><a href="#sec-3">3 Resources on Scheme </a>
<ul>
<li><a href="#sec-3_1">3.1 Books on Scheme </a></li>
<li><a href="#sec-3_2">3.2 Online resources </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Dialects of Scheme </a></li>
<li><a href="#sec-5">5 My FAQ about Scheme </a></li>
<li><a href="#sec-6">6 IDEs for Scheme </a></li>
<li><a href="#sec-7">7 Scheme tutorials </a></li>
<li><a href="#sec-8">8 My tutorial on the lambda calculus </a></li>
<li><a href="#sec-9">9 My Scheme programs </a></li>
<li><a href="#sec-10">10 Programs that have no straightforward equivalent in ML </a></li>
<li><a href="#sec-11">11 Useful Scheme packages I had written </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is Scheme </h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Why Scheme? </h2>
<div class="outline-text-2" id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Resources on Scheme </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Books on Scheme </h3>
<div class="outline-text-3" id="text-3_1">


<p>
<a name="books-on-scheme" id="books-on-scheme"></a>
PLEASE read the following <a href="./disclaimer-on-books.html">disclaimer</a>
</p>
<ul>
</ul>


</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Online resources </h3>
<div class="outline-text-3" id="text-3_2">


<ul>
<li>
<a href="http://en.wikipedia.org/wiki/Scheme_(programming_language)">Scheme at the Wikipedia</a>
</li>
<li>
<a href="http://www.r6rs.org/">The Scheme standard (R<sup>6</sup>RS)</a>
</li>
<li>
The USENET newsgroup <a href="http://groups.google.com/group/comp.lang.scheme/topics"><code>comp.lang.scheme</code></a> (via <a href="http://groups.google.com/">Google Groups</a>)
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dialects of Scheme </h2>
<div class="outline-text-2" id="text-4">


<ul>
<li>
Bigloo
</li>
<li>
Chez Scheme
</li>
<li>
Dr Scheme
</li>
<li>
Geneva Scheme
</li>
<li>
Guile
</li>
<li>
Kawa
</li>
<li>
MacScheme
</li>
<li>
MIT Scheme
</li>
<li>
SCM
</li>
<li>
Stklos
</li>
<li>
TI Scheme
</li>
<li>
UCB Schdeme (modified STk)
</li>
<li>
Wraith Scheme
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> My FAQ about Scheme </h2>
<div class="outline-text-2" id="text-5">


<ul>
<li>
Changing the case of chars, strings, symbols

</li>
<li>
How to debug Scheme programs

</li>
<li>
How to see what symbols are in the symbol table

</li>
<li>
How to use the read-eval-print loop

</li>
<li>
Redefining keywords in Scheme

</li>
<li>
Working with characters

</li>
<li>
Working with dotted pairs

</li>
<li>
Working with files

</li>
<li>
Working with Numbers

</li>
<li>
Working with sexprs

</li>
<li>
Working with strings

</li>
<li>
Working with symbols

</li>
<li>
Working with vectors

</li>
<li>
Working with the backquote mechanism
</li>
</ul>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> IDEs for Scheme </h2>
<div class="outline-text-2" id="text-6">


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Scheme tutorials </h2>
<div class="outline-text-2" id="text-7">


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> My tutorial on the lambda calculus </h2>
<div class="outline-text-2" id="text-8">


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> My Scheme programs </h2>
<div class="outline-text-2" id="text-9">


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Programs that have no straightforward equivalent in ML </h2>
<div class="outline-text-2" id="text-10">


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Useful Scheme packages I had written </h2>
<div class="outline-text-2" id="text-11">





</div>
</div>
<div id="postamble">
<p class="author"> Author: Mayer Goldberg
</p>
<p class="date"> Date: 2011-02-21 13:03:34 IST</p>
</div>
</div>
</body>
</html>
